let data = [
    {
        id: 0,
        name: `Биография`,
        blocks: [
            {
                type: `p`,
                data: `Русский военный гений, великий полководец, генералиссимус победы – какие бы эпитеты не употребляли в его отношении, преувеличить заслуги выдающегося военного стратега сложно. Он выиграл более 60 сражений, в которых участвовал. Александр Васильевич Суворов заботился о солдатах как отец, разработав для них практичную униформу, сменившую узкие прусские мундиры, усовершенствовав устав и правила воспитания.`
            },
            {
                type: `img`,
                data: `./img/task05/01.jpg`,
                label: `Портрет Александра Суворова`
            },
            {
                type: `p`,
                data: `Историки называют полководца уникальным, ведь за полвека службы он вел исключительно наступательные операции и ни разу не участвовал в оборонительной войне. Суворов сумел обезопасить страну от агрессивных соседей на долгие десятилетия, сделав границы государства нерушимыми.`
            }
        ]
    },
    {
        id: 1,
        name: `Детство и юность`,
        blocks: [
            {
                type: `p`,
                data: `Родился будущий генералиссимус в семье генерала Василия Суворова, крестника Петра Первого, начинавшего службу денщиком и переводчиком при царе. При Екатерине Второй Василий Иванович служил в тайной канцелярии и дослужился до генеральского звания. Незадолго до отставки стал сенатором. Мама знаменитого полководца Авдотья Манукова происходит из старинного дворянского рода. Ее отец был вице-президентом Вотчинной коллегии.`    
            },
            {
                type: `img`,
                data: `./img/task05/02.jpg`,
                label: `Александр Суворов` 
            },
            {
                type: `p`,
                data: `Возможно, в жилах Александра Суворова текла не только русская, но также шведская и армянская кровь. Семейная легенда гласит, что род полководца произошел от знатного шведа Сувора, ставшего русским подданным в 1622 году. А материнские корни зарыты в Армении («манук» в переводе с армянского языка – ребенок).
                О годе и месяце рождения Александра Суворова спорят, чему виной он сам. В автобиографии военачальник указал, что приступил к службе 15-летним парнем в 1742 году (т.е. дата рождения – 1727 год). В другой записке Александр Васильевич указывает 1730-й. Есть и третья дата – 1729 год, указанный в полковом журнале, куда поступил на службу подросток.
                Имя сыну дал отец, прославившийся написанием первого в России военного словаря. Неудивительно, что Василий Суворов назвал отпрыска в честь древнерусского полководца Александра Невского. Интерес к военному делу мальчик перенял от родителя: благодаря Василию Ивановичу в имении была богатейшая библиотека. На полках хранились пособия по артиллерийскому и фортификационному делу, к которым юный Саша пристрастился, едва научившись читать.`    
            },
            {
                type: `p`,
                data: `Но отец, мечтавший о продолжателе военного рода, весьма скептически оценивал будущее сына: мальчик рос болезненным и хилым. Василий Иванович видел Александра гражданским служащим. Но мальчик, знавший в подростковом возрасте о военном деле то, что было известно не всякому офицеру, нацелился на карьеру военного. Юный Суворов закалялся и каждый день подвергал тело изнурительным физическим упражнениям.

                Однажды гостивший в доме генерал Абрам Ганнибал заметил, что мальчик, играя в солдатики, весьма грамотно ведет «бой» и владеет тактикой. Ганнибал посоветовал Суворову-старшему выбрать сыну военную специальность.`
            }
        ]
    },
    {
        id: 2,
        name: `Военная служба`,
        blocks: [
            {
                type: `p`,
                data: `В 1742 году Александр Суворов стал мушкетером Семеновского полка. Через 6 лет, получив офицерский чин, приступил к действительной военной службе. В это время юноша совершенствовал знания, посещая занятия корпуса кадетов Санкт-Петербурга и изучая иностранные языки.`   
            },
            {
                type: `img`,
                data: `./img/task05/03.jpg`,
                label: `Елизавета Петровна дарит Александру Суворову серебряный рубль`    
            },
            {
                type: `p`,
                data: `В 1754-м поручика Александра Суворова прикомандировали к Ингерманландскому полку пехоты. Через год взяли служить в Военную коллегию, где он пробыл до 1758 года. В первые годы Семилетней войны Суворов служил в тыловом подразделении, пройдя чины от провиантмейстера до премьер-майора, изучив работу тыловых служб и армейского снабжения.
                В 1758-м Александра Суворова перевели в действующую армию. Спустя год будущий генералиссимус участвовал в первом бою: возглавив драгунский эскадрон, успешно атаковал, заставив бежать германских драгун.
                Первое сражение, участником которого стал Суворов, состоялось под Кунерсдорфом в августе 1759 года. Эта войсковая операция известна как переломная в Семилетней войне. Она поставила точку в разгроме прусской армии. Проявив себя в сражении, Александр Суворов стал дежурным офицером при главнокомандующем Виллиме Ферморе. С генерал-аншефом он участвовал в успешной Берлинской экспедиции.`

            },
            {
                type: `img`,
                data: `./img/task05/04.jpg`,
                label: `Генералиссимус Александр Суворов`    
            },
            {
                type: `p`,
                data: `В начале 1760-х Александр Суворов перешел в подчинение к генералу фон Бергу. Ему доверили командовать гусарскими и драгунскими отрядами, прикрывавшими отход русской дивизии к Бреславлю и уничтожавшими провиант противника. Осенью 1762 года Суворов произведен в полковничий чин и поставлен во главе Астраханского полка. За отменную службу императрица подарила Александру Васильевичу свой портрет. С этого момента, по мнению Суворова, начался его путь к славе.

                С 1763 по 1769 годы Александр Суворов руководил Суздальским полком, дислоцированным в Новой Ладоге. В это время он написал «Полковое учреждение» - правила воспитательной работы, внутренней службы и боевой подготовки солдат. Осенью 1768-го Суворову присвоили звание бригадира.`   
            },
        ]
    },
    {
        id: 3,
        name: `Войны`,
        blocks: [
            {
                type: `p`,
                data: `Формирование Суворова как полководца выпало на век Екатерины Великой и две победные Русско-турецкие войны. В 1770-м Александру Васильевичу присвоили звание генерал-майора. После победы над турками под Туртукаем и Козлуджи он стал генерал-поручиком. В это время Суворову посчастливилось служить под началом фельдмаршала Петра Румянцева. Дарование полководца раскрылось во второй Русско-турецкой войне. В 1788 году генерал-аншеф Александр Суворов отличился при обороне Кинбурна. Здесь он получил первое серьезное ранение.`    
            },
            {
                type: `img`,
                data: `./img/task05/05.jpg`,
                label: `Взятие крепости Кольберг в ходе Семилетней войны`
            },
            {
                type: `p`,
                data: `За победное сражение военачальнику вручили орден Андрея Первозванного. Второй раз Суворова ранили при штурме турецкой крепости в Очакове. Между двумя турецкими войнами Александр Суворов доказал свою эффективность как военачальник и стратег, подавив бунт Емельяна Пугачева. Императрица отблагодарила его 2 тысячами червонцев. В сентябре 1789 года состоялось сражение при Рымнике. 25 тысяч русско-австрийских солдат разгромили 100-тысячное турецкое войско Юсуф-паши. Русские силы в этом бою возглавил Александр Суворов.
                Победа при Рымнике продемонстрировала преимущество русского оружия на военном театре, изменив стратегическую обстановку на фронте. Яркой победой военачальника стало стремительное взятие в декабре 1790 года турецкой крепости Измаил, которую считали неприступной. Битва вошла в анналы истории России, ее ставят в один ряд с Полтавским и Бородинским сражениями.
                После смерти императрицы в 1796 году ее заменил Павел Первый. Отношения с сыном Екатерины Алексеевны у Александра Суворова складывались напряженные. Спустя год царь издал приказ об отставке военачальника. В феврале фельдмаршала сослали в родовое имение. Но после обострения политической обстановки в Европе об Александре Васильевиче вспомнили. Правители Австрии и Британии обратились к Павлу I с просьбой поставить во главе союзных войск Суворова.
                Итальянская кампания, проведенная старым военачальником в 1799-м, вызывает восхищение у современников. Александр Суворов провел ряд молниеносных и блистательных сражений. Фельдмаршал занял Турин и Милан, разбил силы французов на реке Треббия, сократив армию врага наполовину.`    
            },
            {
                type: `img`,
                data: `./img/task05/06.jpg`,
                label: `Переход Александра Суворова через Альпы`
            },
            {
                type: `p`,
                data: `Французы собрали остатки армии и во главе с генералом Жубером двинулись на Пьемонт. В августе они заняли город Нови-Лигуре. Союзническая армия во главе с Александром Суворовым приняла вызов. В 18-часовом сражении при Нови французская армия была разбита, потеряв 7 тысяч солдат убитыми. Погиб и командующий Жубер. Эта победа оказалась решающей в Итальянском походе. Пораженный победой император распорядился отдавать Александру Суворову те же почести, что и особам императорской фамилии.
                Поход 1799 года золотыми буквами вписан в историю российской армии. Легендарный переход Суворова через Альпы и сегодня поражает воображение. Павел I с восхищением констатировал победу Александра Суворова над самой природой. Покорение швейцарских горных вершин и длиннейший перечень предыдущих побед принесли полководцу прижизненную славу и звание генералиссимуса – высочайшее в военной иерархии.
                Александр Суворов создал новую военную доктрину. Основываясь на личном опыте боевых действий, разработал стратегию и тактику ведения войны. Написанное полководцем тактическое пособие «Наука побеждать» – настольная книга русских военачальников. Воспитанниками Суворова стали Михаил Кутузов, Николай Раевский, Петр Багратион. Полководец награжден всеми высшими воинскими наградами, в том числе орденом Святого Георгия трех степеней.
                Памятник генералиссимусу воздвигли при жизни. Появились суворовские училища, в которых воспитывали будущих военных. Во время Великой Отечественной войны орденом Суворова награждали героев, а именем полководца назван не один десяток кораблей. Среди них броненосец «Князь Суворов» и теплоход «Александр Суворов».
                Образ гениального военачальника неоднократно эксплуатировался режиссерами. Александра Суворова сыграли Николай Черкасов («Суворов»), Юрий Катин-Ярцев («Багратион»), Валерий Золотухин («Адъютанты любви»), Вадим Демчог («Фаворит»).
                Звезду «Москва слезам не верит» подкосила смерть мужа`    
            }
        ]
    },
    {
        id: 4,
        name: `Личная жизнь`,
        blocks: [
            {
                type: `p`,
                data: `Единственным фронтом, на котором Александр Суворов проиграл, оказался личный. Увлечение военным ремеслом отобрало у полководца юность и молодость. В 40 лет военачальник не имел ни семьи, ни детей. Исправить ситуацию взялся отец. Василий Иванович сосватал сыну красавицу-невесту. Ею оказалась 23-летняя Варвара Прозоровская, девушка из обедневшего дворянского рода.`    
            },
            {
                type: `img`,
                data: `./img/task05/07.jpg`,
                label: `Варвара Прозоровская, жена Александра Суворова`
            },
            {
                type: `p`,
                data: `В декабре 1773 состоялась помолвка, в январе следующего года – свадьба. Под венец стали двое на удивление непохожих людей: невзрачный, тщедушного телосложения Суворов, рядом с которым цветущая красавица Варвара казалась еще лучше.
                Но Александр Суворов был умнейшим и образованнейшим человеком эпохи, знавшим 5 иностранных языков, а Прозоровская писала с чудовищными ошибками, а круг ее интересов ограничивался нарядами и светскими раутами.
                Напряжение между супругами росло. После рождения дочери Натальи у пары начались размолвки и ссоры. Александр Васильевич пропадал на фронтах и сражениях. Варвара Ивановна вела тот способ жизни, который вели все дамы той эпохи.
                Узнав от «доброжелателей» об изменах супруги, Александр Суворов поступил согласно характеру: подал прошение о разводе в Духовную консисторию, описав поведение неверной жены в подробностях. Но расторгнуть брак не удалось – скандал уладила императрица. Екатерина Алексеевна вручила полководцу очередную медаль и попросила не выносить сор из избы.`    
            },
            {
                type: `img`,
                data: `./img/task05/08.jpg`,
                label: `Наталья Зубова, дочь Александра Суворова`
            },
            {
                type: `p`,
                data: `Напряжение между супругами росло. После рождения дочери Натальи у пары начались размолвки и ссоры. Александр Васильевич пропадал на фронтах и сражениях. Варвара Ивановна вела тот способ жизни, который вели все дамы той эпохи.
                Узнав от «доброжелателей» об изменах супруги, Александр Суворов поступил согласно характеру: подал прошение о разводе в Духовную консисторию, описав поведение неверной жены в подробностях. Но расторгнуть брак не удалось – скандал уладила императрица. Екатерина Алексеевна вручила полководцу очередную медаль и попросила не выносить сор из избы.`    
            },
            {
                type: `img`,
                data: `./img/task05/09.jpg`,
                label: `Аркадий Суворов, сын Александра Суворова`
            },
            {
                type: `p`,
                data: `Но в 1784 году Суворов во второй раз потребовал развода, объявив имя любовника жены. Через два месяца Варвара Ивановна родила сына Аркадия, которого Александр Суворов признал через 12 лет. Супругов не развели и второй раз, но вместе они больше не жили. Полководец установил жене скромное содержание в 1200 рублей, а дочь Наталью определил в Смольный институт, запретив видеться с матерью.
                В 1796-м Суворов признал сына и определил 12-летнего мальчика в юнкера. Судьба Аркадия Суворова сложилась трагично: он утонул в 26 лет. Но четверых внуков отцу он успел подарить. Шесть детей родила и Наталья Суворова. Военачальник так и не простил супругу, до смерти жившую, как и он, в уединении.`    
            }
        ]
    },
    {
        id: 5,
        name: `Смерть`,
        blocks: [
            {
                type: `p`,
                data: `После окончания швейцарского похода Александр Суворов возвратился в Россию. Измотанный переходом через Альпы полководец заболел. Добравшись до родового имения в Кобрине, слег. В Петербурге генералиссимуса ждали, готовя герою торжественную встречу. Направленный царем доктор поставил Александра Васильевича на ноги.`
            },
            {
                type: `img`,
                data: `./img/task05/10.jpg`,
                label: `Могила Александра Суворова в Благовещенской церкви`
            },
            {
                type: `p`,
                data: `Приехав в северную столицу, Суворов остановился в доме племянницы и снова слег. На этот раз – навсегда. Скончался полководец в доме по Крюкову каналу. Император на похороны не приехал. Похоронили Александра Суворова в Благовещенской церкви Александро-Невской лавры.`
            }
        ]
    }
]